# shopping_str = "яблоки, груши, бананы, апельсины"
# print(shopping_str)
# # Выведет: яблоки, груши, бананы, апельсины

# shopping_list = ["яблоки", "груши", "бананы", "апельсины"]
# print(shopping_list)
# # Выведет: ['яблоки', 'груши', 'бананы', 'апельсины']

# shopping_list = ["яблоки", "груши", "бананы", "апельсины"]
# print(shopping_list[2])
# # Выведет: бананы

# shopping_list = ["яблоки", "груши", "бананы", "апельсины"]
# shopping_list[2] = "виноград"
# print(shopping_list)
# # Выведет: ['яблоки', 'груши', 'виноград', 'апельсины']

# shopping_list = ["яблоки", "груши", "бананы", "апельсины"]
# print(shopping_list[0:2])
# # Выведет: ['яблоки', 'груши']

# nested = [[1, 2, 3], ["а", "б", "в"]]
# print(nested)
# # Выведет: [[1, 2, 3], ['а', 'б', 'в']]
# print(nested[1][2])

# shopping_list = ["яблоки", "груши", "виноград", "апельсины"]
# shopping_list.append("манго")
# print(shopping_list)
# # ['яблоки', 'груши', 'виноград', 'апельсины', 'манго']

# fruits = ["яблоко", "груша", "банан"]
# # Вставим "апельсин" на вторую позицию (с индексом 1)
# fruits.insert(1, "апельсин")
# print(fruits)
# # Выведет: ['яблоко', 'апельсин', 'груша', 'банан']

# shopping_list = ["яблоки", "груши", "виноград", "апельсины","манго"]
# del shopping_list[3] # удаляем элемент с индексом 3 — "апельсины"
# print(shopping_list)
# # ['яблоки', 'груши', 'виноград', 'манго']


# list_a = [1, 2, 3]
# list_b = ["а", "б", "в"]
# list_c = list_a + list_b
# print(list_c)
# # [1, 2, 3, 'а', 'б', 'в']

# numbers = [7, 8]
# print(numbers * 3)
# # [7, 8, 7, 8, 7, 8]