
# contacts_list = [ "Иван, +7-123-456-7890",
#                   "Мария, +7-987-654-3210",
#                   "Павел, +7-555-111-2222"]
#
# print(contacts_list)
# # Выведет список строк

# contacts = {"Иван": "+7-123-456-7890",
#             "Мария": "+7-987-654-3210",
#             "Павел": "+7-555-111-2222"}
#
# print(contacts)
# # Выведет словарь с именами и номерами

# contacts = {"Иван": "+7-123-456-7890",
#             "Мария": "+7-987-654-3210",
#             "Павел": "+7-555-111-2222"}
#
# print(contacts["Мария"])
# # Выведет: +7-987-654-3210


# contacts = {"Иван": "+7-123-456-7890",
#             "Мария": "+7-987-654-3210",
#             "Павел": "+7-555-111-2222"}
#
# contacts["Аня"] = "+7-777-888-9999"
# print(contacts["Аня"])
# # Выведет: +7-777-888-9999

# contacts = {"Иван": "+7-123-456-7890",
#             "Мария": "+7-987-654-3210",
#             "Павел": "+7-555-111-2222",
#             "Аня":"+7-777-888-9999"}
#
# contacts["Павел"] = "+7-000-111-2222"
# print(contacts["Павел"])
# # Выведет новый номер


# contacts = {"Иван": "+7-000-111-2222",
#             "Мария": "+7-987-654-3210",
#             "Павел": "+7-555-111-2222",
#             "Аня":"+7-777-888-9999"}
#
# del contacts["Иван"]
# print(contacts)
# # Иван удалён из словаря

contacts = {"Мария": "+7-987-654-3210",
            "Павел": "+7-555-111-2222",
            "Аня":"+7-777-888-9999"}

if "Мария" in contacts:
    print("Номер Марии есть в контактах")
else:
    print("Такого контакта нет")